app/controllers/meetings_controller.rb

      offset = (@page_number[:current] - 1) * @meetings_per_page
    end

    @page_number[:last] = (Meeting.count / @meetings_per_page).ceil
---
SELECT * FROM "meetings" WHERE ((title LIKE "%sis%" OR note LIKE "%sis%" OR organizer LIKE "%sis%"))
SELECT count(*) AS count_all FROM "meetings"

  def show
    @meeting = nil
    begin
      @meeting = Meeting.find(params[:id])
    rescue
      render "e404", :layout => "meetings", :status => 404
      return
    end

    if @meeting.nil?
      render "e404", :layout => "meetings", :status => 404
    end

    if params[:key]
      key_register @meeting.id, params[:key]
    end

    if params[:pid] and params[:response]
      @active_participant = @meeting.participants.find(params[:pid])
---
SELECT * FROM "meetings" WHERE ("meetings"."id" = 1)
SELECT * FROM "participants" WHERE ("participants"."id" = 9 AND ("participants".meeting_id = 2))

  def edit
    @meeting = Meeting.find(params[:id])
---
SELECT * FROM "meetings" WHERE ("meetings"."id" = 2)

  def create
    @meeting = Meeting.new(params[:meeting])

    if @meeting.start > @meeting.finish
      @meeting.finish = @meeting.start
    end

    respond_to do |format|
      if @meeting.save
---
INSERT INTO "meetings" ("finish", "created_at", "title", "updated_at", "organizer", "start", "note", "status", "key") VALUES('2010-06-18 21:30:00', '2010-06-04 01:11:50', 'Graduation Celebration', '2010-06-04 01:11:50', '@shiroyuki', '2010-06-18 17:00:00', 'This meeting is to celebrate Thai students who graduates from the University of Waterloo (http://www.uwaterloo.ca) and attends the Spring convocation this year.

  def update
    @meeting = Meeting.find(params[:id])
    if params[:do_notify] and params[:do_notify] == "on"
      send_update
    end

    respond_to do |format|
      if @meeting.update_attributes(params[:meeting])
---
SELECT * FROM "meetings" WHERE ("meetings"."id" = 5)
UPDATE "meetings" SET "updated_at" = '2010-06-04 06:43:37', "start" = '2010-05-23 20:26:00', "title" = 'Project Hourglass - Promotion', "finish" = '2010-06-23 20:26:00', "note" = 'Set up the public homepage for Hourglass project (http://hourglass.shiroyuki.com).', "status" = 8 WHERE "id" = 7

  def destroy
    @meeting = Meeting.find(params[:id])
    @meeting.destroy
---
SELECT * FROM "meetings" WHERE ("meetings"."id" = 1)
DELETE FROM "meetings" WHERE "id" = 1