app/controllers/participants_controller.rb

SELECT * FROM "participants"
---
  def index
    @participants = Participant.all

SELECT * FROM "participants" WHERE ("participants"."id" = 3)
---
  def show
    #head :status => 405
    #return

    @participant = Participant.find(params[:id])

SELECT * FROM "participants" WHERE ("participants"."id" = 3)
---
  def edit
    #head :status => 405
    #return

    @participant = Participant.find(params[:id])

SELECT * FROM "participants" WHERE ("participants"."id" = 3)
UPDATE "participants" SET "updated_at" = '2010-08-09 03:13:38', "note" = 'By the way, the confirmation URL can be received via email.', "status" = 1 WHERE "id" = 37
---
  def update
    @participant = Participant.find(params[:id])
    @notice = nil
    respond_to do |format|
      if @participant.update_attributes(params[:participant])

SELECT * FROM "meetings" WHERE ("meetings"."id" = 11)
SELECT * FROM "participants" WHERE ("participants".meeting_id = 1 AND ("participants"."meeting_id" = 1 AND "participants"."email" = 'test@test.com3'))
INSERT INTO "participants" ("meeting_id", "name", "created_at", "updated_at", "note", "status", "email") VALUES(NULL, 'Iwata Kanata', '2010-06-04 18:38:59', '2010-06-04 18:38:59', '', NULL, 'sis8c1@unsis.mil')
---
  def create
    @meeting = Meeting.find(params[:meeting_id])

    params[:participant][:name] = params[:participant][:name].strip
    params[:participant][:email] = params[:participant][:email].strip
    params[:participant][:status] = 0

    if !@meeting.participants.find(:all, :conditions => {:meeting_id => @meeting.id, :email => params[:participant][:email]}).empty?
      @participant = nil
      @notice = 'Already sent the invitation to ' + params[:participant][:email]
    elsif !email_valid? params[:participant][:email]
      @participant = nil
      @notice = 'Email is invalid.'
    else
      @participant = @meeting.participants.create!(params[:participant])

SELECT * FROM "meetings" WHERE ("meetings"."id" = 1)
SELECT * FROM "participants" WHERE ("participants"."id" = 9)
DELETE FROM "participants" WHERE "id" = 9
---
  def destroy
    begin
      @meeting = Meeting.find(params[:meeting_id])
      @participant = @meeting.participants.find(params[:id])
    rescue
      @participant = Participant.find(params[:id])
      @meeting = Meeting.find(@participant.meeting_id)
    end

    @participant.destroy